# OLAP Cubes

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created my `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

In [5]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

createdb: database creation failed: ERROR:  database "pagila_star" already exists
 set_config
------------

(1 row)

psql:Data/pagila-star.sql:28: ERROR:  type "mpaa_rating" already exists
psql:Data/pagila-star.sql:38: ERROR:  type "year" already exists
psql:Data/pagila-star.sql:55: ERROR:  function "_group_concat" already exists with same argument types
psql:Data/pagila-star.sql:72: ERROR:  function "film_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:89: ERROR:  function "film_not_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:134: ERROR:  function "get_customer_balance" already exists with same argument types
psql:Data/pagila-star.sql:156: ERROR:  function "inventory_held_by_customer" already exists with same argument types
psql:Data/pagila-star.sql:193: ERROR:  function "inventory_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:211: ERROR:  function "last_day" already exists with same argument types
psql:Data/pagila-star.sql:226: ERROR:  function "last_updated" already exists with same argument types
psql:Data/pagila-star.sql:250: ERROR:  relation "customer" already exists
psql:Data/pagila-star.sql:314: ERROR:  function "rewards_report" already exists with same argument types
psql:Data/pagila-star.sql:326: ERROR:  function "group_concat" already exists with same argument types
psql:Data/pagila-star.sql:340: ERROR:  relation "actor_actor_id_seq" already exists
psql:Data/pagila-star.sql:354: ERROR:  relation "actor" already exists
psql:Data/pagila-star.sql:368: ERROR:  relation "category_category_id_seq" already exists
psql:Data/pagila-star.sql:381: ERROR:  relation "category" already exists
psql:Data/pagila-star.sql:395: ERROR:  relation "film_film_id_seq" already exists
psql:Data/pagila-star.sql:419: ERROR:  relation "film" already exists
psql:Data/pagila-star.sql:432: ERROR:  relation "film_actor" already exists
psql:Data/pagila-star.sql:445: ERROR:  relation "film_category" already exists
psql:Data/pagila-star.sql:468: ERROR:  relation "actor_info" already exists
psql:Data/pagila-star.sql:482: ERROR:  relation "address_address_id_seq" already exists
psql:Data/pagila-star.sql:500: ERROR:  relation "address" already exists
psql:Data/pagila-star.sql:514: ERROR:  relation "city_city_id_seq" already exists
psql:Data/pagila-star.sql:528: ERROR:  relation "city" already exists
psql:Data/pagila-star.sql:542: ERROR:  relation "country_country_id_seq" already exists
psql:Data/pagila-star.sql:555: ERROR:  relation "country" already exists
psql:Data/pagila-star.sql:569: ERROR:  relation "customer_customer_id_seq" already exists
psql:Data/pagila-star.sql:584: ERROR:  relation "customer_customer_id_seq1" already exists
psql:Data/pagila-star.sql:616: ERROR:  relation "customer_list" already exists
psql:Data/pagila-star.sql:642: ERROR:  relation "dimcustomer" already exists
psql:Data/pagila-star.sql:657: ERROR:  relation "dimcustomer_customer_key_seq" already exists
psql:Data/pagila-star.sql:682: ERROR:  relation "dimdate" already exists
psql:Data/pagila-star.sql:703: ERROR:  relation "dimmovie" already exists
psql:Data/pagila-star.sql:718: ERROR:  relation "dimmovie_movie_key_seq" already exists
psql:Data/pagila-star.sql:747: ERROR:  relation "dimstore" already exists
psql:Data/pagila-star.sql:762: ERROR:  relation "dimstore_store_key_seq" already exists
psql:Data/pagila-star.sql:785: ERROR:  relation "factsales" already exists
psql:Data/pagila-star.sql:800: ERROR:  relation "factsales_sales_key_seq" already exists
psql:Data/pagila-star.sql:830: ERROR:  relation "film_list" already exists
psql:Data/pagila-star.sql:844: ERROR:  relation "inventory_inventory_id_seq" already exists
psql:Data/pagila-star.sql:858: ERROR:  relation "inventory" already exists
psql:Data/pagila-star.sql:872: ERROR:  relation "language_language_id_seq" already exists
psql:Data/pagila-star.sql:885: ERROR:  relation "language" already exists
psql:Data/pagila-star.sql:908: ERROR:  relation "nicer_but_slower_film_list" already exists
psql:Data/pagila-star.sql:922: ERROR:  relation "payment_payment_id_seq" already exists
psql:Data/pagila-star.sql:938: ERROR:  relation "payment" already exists
psql:Data/pagila-star.sql:952: ERROR:  relation "rental_rental_id_seq" already exists
psql:Data/pagila-star.sql:969: ERROR:  relation "rental" already exists
psql:Data/pagila-star.sql:988: ERROR:  relation "sales_by_film_category" already exists
psql:Data/pagila-star.sql:1002: ERROR:  relation "staff_staff_id_seq" already exists
psql:Data/pagila-star.sql:1023: ERROR:  relation "staff" already exists
psql:Data/pagila-star.sql:1037: ERROR:  relation "store_store_id_seq" already exists
psql:Data/pagila-star.sql:1051: ERROR:  relation "store" already exists
psql:Data/pagila-star.sql:1073: ERROR:  relation "sales_by_store" already exists
psql:Data/pagila-star.sql:1094: ERROR:  relation "staff_list" already exists
psql:Data/pagila-star.sql:1339: ERROR:  duplicate key value violates unique constraint "actor_pkey"
DETAIL:  Key (actor_id)=(1) already exists.
CONTEXT:  COPY actor, line 1
psql:Data/pagila-star.sql:1950: ERROR:  duplicate key value violates unique constraint "address_pkey"
DETAIL:  Key (address_id)=(1) already exists.
CONTEXT:  COPY address, line 1
psql:Data/pagila-star.sql:1974: ERROR:  duplicate key value violates unique constraint "category_pkey"
DETAIL:  Key (category_id)=(1) already exists.
CONTEXT:  COPY category, line 1
psql:Data/pagila-star.sql:2582: ERROR:  duplicate key value violates unique constraint "city_pkey"
DETAIL:  Key (city_id)=(1) already exists.
CONTEXT:  COPY city, line 1
psql:Data/pagila-star.sql:2699: ERROR:  duplicate key value violates unique constraint "country_pkey"
DETAIL:  Key (country_id)=(1) already exists.
CONTEXT:  COPY country, line 1
psql:Data/pagila-star.sql:3306: ERROR:  duplicate key value violates unique constraint "customer_pkey"
DETAIL:  Key (customer_id)=(1) already exists.
CONTEXT:  COPY customer, line 1
psql:Data/pagila-star.sql:3913: ERROR:  duplicate key value violates unique constraint "dimcustomer_pkey"
DETAIL:  Key (customer_key)=(1) already exists.
CONTEXT:  COPY dimcustomer, line 1
psql:Data/pagila-star.sql:3961: ERROR:  duplicate key value violates unique constraint "dimdate_pkey"
DETAIL:  Key (date_key)=(20170321) already exists.
CONTEXT:  COPY dimdate, line 1
psql:Data/pagila-star.sql:4969: ERROR:  duplicate key value violates unique constraint "dimmovie_pkey"
DETAIL:  Key (movie_key)=(1) already exists.
CONTEXT:  COPY dimmovie, line 1
psql:Data/pagila-star.sql:4979: ERROR:  duplicate key value violates unique constraint "dimstore_pkey"
DETAIL:  Key (store_key)=(1) already exists.
CONTEXT:  COPY dimstore, line 1
psql:Data/pagila-star.sql:21036: ERROR:  duplicate key value violates unique constraint "factsales_pkey"
DETAIL:  Key (sales_key)=(1) already exists.
CONTEXT:  COPY factsales, line 1
psql:Data/pagila-star.sql:22044: ERROR:  duplicate key value violates unique constraint "film_pkey"
DETAIL:  Key (film_id)=(1) already exists.
CONTEXT:  COPY film, line 1: "1	ACADEMY DINOSAUR	A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The C..."
psql:Data/pagila-star.sql:27514: ERROR:  duplicate key value violates unique constraint "film_actor_pkey"
DETAIL:  Key (actor_id, film_id)=(1, 1) already exists.
CONTEXT:  COPY film_actor, line 1
psql:Data/pagila-star.sql:28522: ERROR:  duplicate key value violates unique constraint "film_category_pkey"
DETAIL:  Key (film_id, category_id)=(1, 6) already exists.
CONTEXT:  COPY film_category, line 1
psql:Data/pagila-star.sql:33111: ERROR:  duplicate key value violates unique constraint "inventory_pkey"
DETAIL:  Key (inventory_id)=(1) already exists.
CONTEXT:  COPY inventory, line 1
psql:Data/pagila-star.sql:33125: ERROR:  duplicate key value violates unique constraint "language_pkey"
DETAIL:  Key (language_id)=(1) already exists.
CONTEXT:  COPY language, line 1
psql:Data/pagila-star.sql:65234: ERROR:  duplicate key value violates unique constraint "rental_pkey"
DETAIL:  Key (rental_id)=(2) already exists.
CONTEXT:  COPY rental, line 1
psql:Data/pagila-star.sql:65244: ERROR:  duplicate key value violates unique constraint "staff_pkey"
DETAIL:  Key (staff_id)=(1) already exists.
CONTEXT:  COPY staff, line 1
psql:Data/pagila-star.sql:65254: ERROR:  duplicate key value violates unique constraint "store_pkey"
DETAIL:  Key (store_id)=(1) already exists.
CONTEXT:  COPY store, line 1
 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

psql:Data/pagila-star.sql:65388: ERROR:  multiple primary keys for table "actor" are not allowed
psql:Data/pagila-star.sql:65396: ERROR:  multiple primary keys for table "address" are not allowed
psql:Data/pagila-star.sql:65404: ERROR:  multiple primary keys for table "category" are not allowed
psql:Data/pagila-star.sql:65412: ERROR:  multiple primary keys for table "city" are not allowed
psql:Data/pagila-star.sql:65420: ERROR:  multiple primary keys for table "country" are not allowed
psql:Data/pagila-star.sql:65428: ERROR:  multiple primary keys for table "customer" are not allowed
psql:Data/pagila-star.sql:65436: ERROR:  multiple primary keys for table "dimcustomer" are not allowed
psql:Data/pagila-star.sql:65444: ERROR:  multiple primary keys for table "dimdate" are not allowed
psql:Data/pagila-star.sql:65452: ERROR:  multiple primary keys for table "dimmovie" are not allowed
psql:Data/pagila-star.sql:65460: ERROR:  multiple primary keys for table "dimstore" are not allowed
psql:Data/pagila-star.sql:65468: ERROR:  multiple primary keys for table "factsales" are not allowed
psql:Data/pagila-star.sql:65476: ERROR:  multiple primary keys for table "film_actor" are not allowed
psql:Data/pagila-star.sql:65484: ERROR:  multiple primary keys for table "film_category" are not allowed
psql:Data/pagila-star.sql:65492: ERROR:  multiple primary keys for table "film" are not allowed
psql:Data/pagila-star.sql:65500: ERROR:  multiple primary keys for table "inventory" are not allowed
psql:Data/pagila-star.sql:65508: ERROR:  multiple primary keys for table "language" are not allowed
psql:Data/pagila-star.sql:65516: ERROR:  multiple primary keys for table "rental" are not allowed
psql:Data/pagila-star.sql:65524: ERROR:  multiple primary keys for table "staff" are not allowed
psql:Data/pagila-star.sql:65532: ERROR:  multiple primary keys for table "store" are not allowed
psql:Data/pagila-star.sql:65539: ERROR:  relation "film_fulltext_idx" already exists
psql:Data/pagila-star.sql:65546: ERROR:  relation "idx_actor_last_name" already exists
psql:Data/pagila-star.sql:65553: ERROR:  relation "idx_fk_address_id" already exists
psql:Data/pagila-star.sql:65560: ERROR:  relation "idx_fk_city_id" already exists
psql:Data/pagila-star.sql:65567: ERROR:  relation "idx_fk_country_id" already exists
psql:Data/pagila-star.sql:65574: ERROR:  relation "idx_fk_customer_id" already exists
psql:Data/pagila-star.sql:65581: ERROR:  relation "idx_fk_film_id" already exists
psql:Data/pagila-star.sql:65588: ERROR:  relation "idx_fk_inventory_id" already exists
psql:Data/pagila-star.sql:65595: ERROR:  relation "idx_fk_language_id" already exists
psql:Data/pagila-star.sql:65602: ERROR:  relation "idx_fk_original_language_id" already exists
psql:Data/pagila-star.sql:65609: ERROR:  relation "idx_fk_payment_customer_id" already exists
psql:Data/pagila-star.sql:65616: ERROR:  relation "idx_fk_payment_staff_id" already exists
psql:Data/pagila-star.sql:65623: ERROR:  relation "idx_fk_store_id" already exists
psql:Data/pagila-star.sql:65630: ERROR:  relation "idx_last_name" already exists
psql:Data/pagila-star.sql:65637: ERROR:  relation "idx_store_id_film_id" already exists
psql:Data/pagila-star.sql:65644: ERROR:  relation "idx_title" already exists
psql:Data/pagila-star.sql:65651: ERROR:  relation "idx_unq_manager_staff_id" already exists
psql:Data/pagila-star.sql:65658: ERROR:  relation "idx_unq_rental_rental_date_inventory_id_customer_id" already exists
psql:Data/pagila-star.sql:65665: ERROR:  trigger "film_fulltext_trigger" for relation "film" already exists
psql:Data/pagila-star.sql:65672: ERROR:  trigger "last_updated" for relation "actor" already exists
psql:Data/pagila-star.sql:65679: ERROR:  trigger "last_updated" for relation "address" already exists
psql:Data/pagila-star.sql:65686: ERROR:  trigger "last_updated" for relation "category" already exists
psql:Data/pagila-star.sql:65693: ERROR:  trigger "last_updated" for relation "city" already exists
psql:Data/pagila-star.sql:65700: ERROR:  trigger "last_updated" for relation "country" already exists
psql:Data/pagila-star.sql:65707: ERROR:  trigger "last_updated" for relation "customer" already exists
psql:Data/pagila-star.sql:65714: ERROR:  trigger "last_updated" for relation "film" already exists
psql:Data/pagila-star.sql:65721: ERROR:  trigger "last_updated" for relation "film_actor" already exists
psql:Data/pagila-star.sql:65728: ERROR:  trigger "last_updated" for relation "film_category" already exists
psql:Data/pagila-star.sql:65735: ERROR:  trigger "last_updated" for relation "inventory" already exists
psql:Data/pagila-star.sql:65742: ERROR:  trigger "last_updated" for relation "language" already exists
psql:Data/pagila-star.sql:65749: ERROR:  trigger "last_updated" for relation "rental" already exists
psql:Data/pagila-star.sql:65756: ERROR:  trigger "last_updated" for relation "staff" already exists
psql:Data/pagila-star.sql:65763: ERROR:  trigger "last_updated" for relation "store" already exists
psql:Data/pagila-star.sql:65771: ERROR:  constraint "address_city_id_fkey" for relation "address" already exists
psql:Data/pagila-star.sql:65779: ERROR:  constraint "city_country_id_fkey" for relation "city" already exists
psql:Data/pagila-star.sql:65787: ERROR:  constraint "customer_address_id_fkey" for relation "customer" already exists
psql:Data/pagila-star.sql:65795: ERROR:  constraint "customer_store_id_fkey" for relation "customer" already exists
psql:Data/pagila-star.sql:65803: ERROR:  constraint "factsales_customer_key_fkey" for relation "factsales" already exists
psql:Data/pagila-star.sql:65811: ERROR:  constraint "factsales_date_key_fkey" for relation "factsales" already exists
psql:Data/pagila-star.sql:65819: ERROR:  constraint "factsales_movie_key_fkey" for relation "factsales" already exists
psql:Data/pagila-star.sql:65827: ERROR:  constraint "factsales_store_key_fkey" for relation "factsales" already exists
psql:Data/pagila-star.sql:65835: ERROR:  constraint "film_actor_actor_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-star.sql:65843: ERROR:  constraint "film_actor_film_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-star.sql:65851: ERROR:  constraint "film_category_category_id_fkey" for relation "film_category" already exists
psql:Data/pagila-star.sql:65859: ERROR:  constraint "film_category_film_id_fkey" for relation "film_category" already exists
psql:Data/pagila-star.sql:65867: ERROR:  constraint "film_language_id_fkey" for relation "film" already exists
psql:Data/pagila-star.sql:65875: ERROR:  constraint "film_original_language_id_fkey" for relation "film" already exists
psql:Data/pagila-star.sql:65883: ERROR:  constraint "inventory_film_id_fkey" for relation "inventory" already exists
psql:Data/pagila-star.sql:65891: ERROR:  constraint "inventory_store_id_fkey" for relation "inventory" already exists
psql:Data/pagila-star.sql:65899: ERROR:  constraint "payment_customer_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:65907: ERROR:  constraint "payment_rental_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:65915: ERROR:  constraint "payment_staff_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:65923: ERROR:  constraint "rental_customer_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:65931: ERROR:  constraint "rental_inventory_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:65939: ERROR:  constraint "rental_staff_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:65947: ERROR:  constraint "staff_address_id_fkey" for relation "staff" already exists
psql:Data/pagila-star.sql:65955: ERROR:  constraint "staff_store_id_fkey" for relation "staff" already exists
psql:Data/pagila-star.sql:65963: ERROR:  constraint "store_address_id_fkey" for relation "store" already exists

In [6]:
%load_ext sql
import sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# STEP1 : Connect to the local database where Pagila is loaded

In [7]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [8]:
%sql $conn_string

'Connected: student@pagila'

# STEP2 :  Facts & Dimensions are supposed to be loaded from Demo01

<img src="pagila-star.png" width="50%"/>

# Start by a simple cube

In [9]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer  on (dimCustomer.customer_key = factSales.customer_key)
group by (dimDate.day, dimMovie.rating, dimCustomer.city)
order by revenue desc
limit  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 3.48 ms, sys: 1.39 ms, total: 4.88 ms
Wall time: 167 ms

[(30, 'G', 'San Bernardino', Decimal('24.97')),
 (30, 'NC-17', 'Apeldoorn', Decimal('23.95')),
 (21, 'NC-17', 'Belm', Decimal('22.97')),
 (28, 'R', 'Mwanza', Decimal('21.97')),
 (21, 'G', 'Citt del Vaticano', Decimal('21.97')),
 (30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (1, 'R', 'Qomsheh', Decimal('19.97')),
 (28, 'PG-13', 'Dhaka', Decimal('19.97')),
 (17, 'G', 'Rajkot', Decimal('19.97')),
 (22, 'R', 'Yangor', Decimal('19.97')),
 (19, 'PG', 'Najafabad', Decimal('19.96')),
 (30, 'R', 'Fengshan', Decimal('19.95')),
 (28, 'PG', 'So Leopoldo', Decimal('18.98')),
 (21, 'G', 'Wroclaw', Decimal('18.98')),
 (1, 'NC-17', 'Memphis', Decimal('18.97')),
 (19, 'PG', 'Sokoto', Decimal('18.97')),
 (29, 'PG-13', 'Shimoga', Decimal('18.97')),
 (30, 'G', 'Omdurman', Decimal('18.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95'))]

## Slicing

- Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2,  fixing one of the dimensions to a single value
- In the following example we have a 3-deminensional cube on day, rating, and city
- In the example below `rating` is fixed and to "PG-13" which reduces the dimensionality

In [10]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating = 'PG-13'
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 3.22 ms, sys: 1.07 ms, total: 4.3 ms
Wall time: 51.3 ms

[(30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (28, 'PG-13', 'Dhaka', Decimal('19.97')),
 (29, 'PG-13', 'Shimoga', Decimal('18.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95')),
 (21, 'PG-13', 'Parbhani', Decimal('17.98')),
 (20, 'PG-13', 'Baha Blanca', Decimal('17.98')),
 (30, 'PG-13', 'Nagareyama', Decimal('17.98')),
 (30, 'PG-13', 'Tanauan', Decimal('17.96')),
 (17, 'PG-13', 'Ikerre', Decimal('17.95')),
 (30, 'PG-13', 'Zhoushan', Decimal('16.98')),
 (30, 'PG-13', 'Newcastle', Decimal('16.97')),
 (30, 'PG-13', 'Yerevan', Decimal('16.97')),
 (17, 'PG-13', 'Yantai', Decimal('15.98')),
 (30, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (20, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (8, 'PG-13', 'Pontianak', Decimal('15.98')),
 (10, 'PG-13', 'Udaipur', Decimal('15.97')),
 (1, 'PG-13', 'Moscow', Decimal('15.97')),
 (23, 'PG-13', 'Tiefa', Decimal('15.97'))]

## Dicing
 - Creating a subcube, same dimensionality, less values for 2 or more dimensions
 - e.g. PG-13

In [11]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating in ('PG-13', 'PG')
AND dimCustomer.city in ('Bellevue', 'Lancaster')
AND dimDate.day in ('1', '15', '30')
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
6 rows affected.
CPU times: user 4.9 ms, sys: 1.47 ms, total: 6.36 ms
Wall time: 13.8 ms

[(30, 'PG', 'Lancaster', Decimal('12.98')),
 (1, 'PG-13', 'Lancaster', Decimal('5.99')),
 (30, 'PG-13', 'Bellevue', Decimal('3.99')),
 (30, 'PG-13', 'Lancaster', Decimal('2.99')),
 (15, 'PG-13', 'Bellevue', Decimal('1.98')),
 (1, 'PG', 'Bellevue', Decimal('0.99'))]

## Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

In [12]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day,  dimMovie.rating, dimCustomer.country)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 3.14 ms, sys: 1.07 ms, total: 4.21 ms
Wall time: 116 ms

[(30, 'G', 'China', Decimal('169.67')),
 (30, 'PG', 'India', Decimal('156.67')),
 (30, 'NC-17', 'India', Decimal('153.64')),
 (30, 'PG-13', 'China', Decimal('146.67')),
 (30, 'R', 'China', Decimal('145.66')),
 (30, 'R', 'India', Decimal('143.68')),
 (30, 'G', 'India', Decimal('137.67')),
 (18, 'NC-17', 'India', Decimal('135.75')),
 (30, 'PG', 'China', Decimal('131.72')),
 (21, 'PG-13', 'India', Decimal('128.74')),
 (18, 'PG-13', 'India', Decimal('121.72')),
 (18, 'PG', 'India', Decimal('119.76')),
 (30, 'PG-13', 'India', Decimal('116.72')),
 (21, 'NC-17', 'China', Decimal('115.77')),
 (21, 'R', 'India', Decimal('115.75')),
 (27, 'NC-17', 'India', Decimal('115.72')),
 (17, 'PG-13', 'China', Decimal('111.75')),
 (17, 'NC-17', 'United States', Decimal('109.76')),
 (30, 'NC-17', 'China', Decimal('108.77')),
 (20, 'PG-13', 'India', Decimal('101.79'))]

## Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up to  `districts`

In [13]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.district, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day, dimCustomer.district, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 3.27 ms, sys: 1.32 ms, total: 4.59 ms
Wall time: 159 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('53.88')),
 (30, 'G', 'Inner Mongolia', Decimal('38.93')),
 (30, 'G', 'Shandong', Decimal('36.93')),
 (30, 'NC-17', 'West Bengali', Decimal('36.92')),
 (17, 'PG-13', 'Shandong', Decimal('34.95')),
 (1, 'PG', 'California', Decimal('32.94')),
 (18, 'NC-17', 'So Paulo', Decimal('32.93')),
 (21, 'R', 'So Paulo', Decimal('31.93')),
 (30, 'NC-17', 'Buenos Aires', Decimal('31.93')),
 (30, 'PG', 'Southern Tagalog', Decimal('30.94')),
 (30, 'PG', 'So Paulo', Decimal('30.93')),
 (30, 'R', 'Buenos Aires', Decimal('30.92')),
 (30, 'G', 'California', Decimal('29.95')),
 (18, 'NC-17', 'Maharashtra', Decimal('29.95')),
 (21, 'PG-13', 'Uttar Pradesh', Decimal('29.94')),
 (10, 'R', 'Maharashtra', Decimal('29.93')),
 (20, 'PG', 'Shandong', Decimal('29.93')),
 (18, 'R', 'Sumy', Decimal('28.97')),
 (21, 'PG-13', 'Southern Tagalog', Decimal('28.96')),
 (20, 'PG-13', 'Buenos Aires', Decimal('28.95'))]

# Grouping Sets
- It happens a lot that for a 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a move clever way to do that using the SQL grouping statement "GROUPING SETS"

## total revenue

In [14]:
%%sql
SELECT sum(sales_amount) as revenue
FROM factSales

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(Decimal('67416.51'),)]

## revenue by country

In [15]:
%%sql
SELECT dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
order by dimStore.country, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[('Australia', Decimal('33726.77')), ('Canada', Decimal('33689.74'))]

## revenue by month

In [16]:
%%sql
SELECT dimDate.month,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
order by dimDate.month, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, Decimal('4824.43')),
 (2, Decimal('9631.88')),
 (3, Decimal('23886.56')),
 (4, Decimal('28559.46')),
 (5, Decimal('514.18'))]

## revenue by month & country

In [17]:
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)
order by dimDate.month, dimStore.country, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10'))]

## revenue total, by month, by country, by month & country All in one shot
- watch the nones

In [18]:
%%time
%%sql
SELECT dimDate.month, dimStore.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by grouping sets ((), dimDate.month,  dimStore.country, (dimDate.month,  dimStore.country));

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 3.23 ms, sys: 1.39 ms, total: 4.62 ms
Wall time: 34.1 ms

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (1, None, Decimal('4824.43')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (2, None, Decimal('9631.88')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, None, Decimal('67416.51')),
 (None, 'Canada', Decimal('33689.74')),
 (None, 'Australia', Decimal('33726.77'))]

# CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations

```SQL
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key   = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);
```

In [19]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);  #similar to what we did above

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 2.7 ms, sys: 1.17 ms, total: 3.88 ms
Wall time: 33 ms

[(1, 'Australia', Decimal('2364.19')),
 (1, 'Canada', Decimal('2460.24')),
 (1, None, Decimal('4824.43')),
 (2, 'Australia', Decimal('4895.10')),
 (2, 'Canada', Decimal('4736.78')),
 (2, None, Decimal('9631.88')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, None, Decimal('67416.51')),
 (None, 'Canada', Decimal('33689.74')),
 (None, 'Australia', Decimal('33726.77'))]

## revenue total, by month, by country, by month & country All in one shot, NAIVE way

In [20]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text), dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 4.78 ms, sys: 1.13 ms, total: 5.92 ms
Wall time: 54.2 ms

[(None, None, Decimal('67416.51')),
 (None, 'Canada', Decimal('33689.74')),
 (None, 'Australia', Decimal('33726.77')),
 ('3', None, Decimal('23886.56')),
 ('5', None, Decimal('514.18')),
 ('4', None, Decimal('28559.46')),
 ('2', None, Decimal('9631.88')),
 ('1', None, Decimal('4824.43')),
 ('1', 'Australia', Decimal('2364.19')),
 ('1', 'Canada', Decimal('2460.24')),
 ('2', 'Australia', Decimal('4895.10')),
 ('2', 'Canada', Decimal('4736.78')),
 ('3', 'Australia', Decimal('12060.33')),
 ('3', 'Canada', Decimal('11826.23')),
 ('4', 'Australia', Decimal('14136.07')),
 ('4', 'Canada', Decimal('14423.39')),
 ('5', 'Australia', Decimal('271.08')),
 ('5', 'Canada', Decimal('243.10'))]